{
  "mainTitle": "My Blog Posts",
  "mainSubtitle": "My thoughts and notes on technology, artificial intelligence, and software development.",
  "readMoreText": "Read More →",
  "seeAllText": "See All Posts",
  "noPostsFound": "No posts found matching your criteria.",
  "searchPlaceholder": "Search in posts...",
  "filterByCategoryTitle": "Category",
  "filterBySortTitle": "Sort",
  "sortNewest": "Newest",
  "sortOldest": "Oldest",

  "python-ile-whatsapp-mesaji-gondermek": {
    "title": "SENDING WHATSAPP MESSAGES WITH PYTHON",
    "summary": "If you have a business and want to increase your sales figures, using WhatsApp can significantly boost your sales.",
    "content": "<p>If you have a business and want to increase your sales figures, using WhatsApp can significantly boost your sales. According to observed data, WhatsApp usage can increase sales by up to 127% and improve customer service by 225%. While small businesses have the ease of responding to customers quickly, we can observe that response times increase in larger businesses. This situation, which negatively affects customer relations, is undesirable for both customers and businesses. For these or various other reasons, we may want to use advanced automated message scenarios in the WhatsApp application.</p><p>In this article, I will explain how to perform the message sending process, a part of automated message scenarios, using the Python programming language with 2 different methods, discussing their advantages and disadvantages.</p><p>The first method I will explain requires us to use the “selenium”, “whatsapp-web”, and “pyautogui” modules. If you haven't installed these modules before, you may need to run the following commands in the terminal sequentially.</p><pre><code>pip install selenium\npip install whatsapp-web\npip install pyautogui</code></pre><p>Let's include the modules we will use in our application.</p><pre><code>from selenium import webdriver\nfrom simon.account.pages import LoginPage\nfrom simon.header.pages import HeaderPage\nimport pyautogui as pg\nimport time</code></pre><p>The Selenium WebDriver module allows us to interact with our preferred web browser. I will use the Chrome browser, but you can proceed with the one that suits you.</p><pre><code>browser = webdriver.Chrome()</code></pre><p>We will use the LoginPage and HeaderPage classes of the whatsapp-web module for logging in and out of WhatsApp Web. Both classes take the browser object as a parameter. With the load function, we open the WhatsApp Web login page, and with the remember_me property, we can check the 'remember me' option. At this step, we need to scan the QR code from the mobile application to log in.</p><pre><code>login = LoginPage(browser)\nlogin.load()\nlogin.remember_me = False</code></pre><p>There is a point we need to be careful about here. Applications, after being run, do not stop on their own and wait for the next step to occur unless we add a waiting period. However, we will pause for a few seconds on the WhatsApp Web login screen, scan the QR code from our mobile device, and this will cause a delay that is short for us but long enough to prevent the application from running. In the next step, we will add a waiting period to our code using the time module.</p><p>The Pyautogui module allows us to perform various operations on the computer screen. The important thing to note is that the page where the message will be written and sent must be open. That is, unless we choose another way (although not covered in this article, we can open the desired chat using other classes of the whatsapp-web module), the person or group chat to whom the message will be sent must be manually opened on the screen before the message is sent. This is another situation that takes time and can disrupt the flow of the program, just like scanning the QR code and logging in. For these reasons, let's proceed by adding a reasonable waiting period to both log in and open the chat we want to send the message to.</p><pre><code>time.sleep(30)</code></pre><p>The 'message' variable represents the text of the message we will send. The message will be written with the write function, and by pressing the 'enter' key with the press function, the message will be sent.</p><pre><code>message = “Hello world”\npg.write(message)\npg.press(“Enter”)</code></pre><p>After sending the message, we need to log out of the WhatsApp Web application and close the browser. We can do this with the following code blocks.</p><pre><code>logout = HeaderPage(browser)\nlogout.logout()\nbrowser.quit()</code></pre><p>Thus, we have learned one of the ways to send a WhatsApp message with Python. This method is disadvantageous in that it requires more user intervention and is not fully automated. When we want to send multiple messages to many people, it can cause more time loss than necessary or we may have to work with unnecessarily long code blocks. Multiple messages sent to a single person can be managed more simply. Being completely free is one of the advantages of this method.</p><p>You can also send messages via WhatsApp using the whatsapp-web module. For detailed information on this topic, you can use the link below:</p><p><a href='https://pypi.org/project/whatsapp-web/' target='_blank' rel='noopener noreferrer'>whatsapp-web A Python library to easily automate whatsapp web pypi.org</a></p><p>The second method we will learn is to send a WhatsApp message with the whatsapp_api_client_python module. To use this module, we must first create an account on the Green-API website. After creating an account, we must perform an authorization process by scanning the QR code on the page that appears from the mobile WhatsApp application. After completing these stages, we can close Green API after noting the Id Instance and API Token Instance information to access our account through the application.</p><p>To use Green API in our Python application, let's first install it from the terminal.</p><pre><code>pip install whatsapp_api_client_python</code></pre><p>Once the installation is complete, we can import it into our application. With this API, we will be able to send messages without opening WhatsApp Web or requiring any user intervention.</p><pre><code>from whatsapp_api_client_python import API</code></pre><p>Let's create variables using the Id Instance and API Token Instance information we noted. These are the variables that represent our Green API identity. Then we will create a GreenAPI object. We will perform message sending operations through this object.</p><pre><code>idInstance = \"**********\"\napiTokenInstance = \"**************************************************\"\ngreenAPI = API.GreenAPI(idInstance, apiTokenInstance)</code></pre><p>To send a message, we enter the phone number of the person we are sending the message to, along with the country code. The sendMessage function sends a message by taking the phone number and message as parameters, but we must write the phone number by adding “@c.us” to it. This completes the message sending process.</p><pre><code>number = \"905*********\"\ngreenAPI.sending.sendMessage(\"number@c.us\", \"hi friend\")</code></pre><p>Thus, we have learned the second way to send WhatsApp messages with Python. This method is advantageous in that it can be fully automated. When we want to send multiple messages to many people, we can perform the operations easily and without time loss, and we do not have to work with long code blocks. It has a free plan for developers, and according to this plan, there is a limit of sending a total of 100 messages to 3 different people per month. However, if our needs are more than this, paid plans should be preferred. Being a paid service is one of the disadvantages of this method.</p><p>Using Green API, we can send photos, links, files, or locations. It is also possible to access previous messages and reply by marking messages. In addition to these, receiving replies as they are sent is provided by greenAPI.webhook.receiver. To learn more about Green API, you can benefit from the article below.</p><p><a href='https://pypi.org/project/whatsapp-api-client-python/' target='_blank' rel='noopener noreferrer'>whatsapp-api-client-python This library helps you easily create a Python application with WhatsApp API. pypi.org</a></p><h3>References:</h3><ol><li>https://codewithcurious.com/projects/send-whatsapp-messages-using-python/</li><li>https://pypi.org/project/whatsapp-web/</li><li>https://pypi.org/project/whatsapp-api-client-python/</li><li>https://console.green-api.com/instanceList</li></ol>"
  },
  "json-verileriyle-calismak": {
    "title": "WORKING WITH JSON DATA",
    "summary": "In a project we are part of or a job we work in, we obtain various data. Often, we need to store this data in some way.",
    "content": "<p>In a project we are part of or a job we work in, we obtain various data. Often, we need to store this data in some way. Today, there are many methods preferred for storing data, and choosing the most suitable one according to the project or job we are involved in is an important issue. Factors such as the size of the data, data types, data security, data storage trends in the sector, the size of the business or project, and the budget allocated for this work are among the elements that affect data storage preferences. Relational and non-relational database systems, cloud systems, or filing systems are a few of the data storage methods. Each has its advantages and disadvantages. Filing systems are generally preferred in small businesses and applications and in API outputs because of their simpler structure and direct accessibility. Also, file systems have different alternatives within themselves. We can store our data in different file types such as Excel files, CSV files, JSON files.</p><p>In this article, I will talk about working with JSON data and answer questions such as what JSON is, what is the difference between the Python dictionary data type and JSON format, how data is written in JSON format, how data in JSON format is read, and how a dictionary data within the program is converted to JSON format.</p><p>JSON, which stands for JavaScript Object Notation, is an open data exchange format that is readable by both humans and machines. It supports data types such as string, array, boolean, object, null, and number, and it is language-independent. To better understand JSON data, we will go through an example. Let's create a file like the one below:</p><p>“PhilosopherSpinoza.json”</p><p>First, we will write the data we want to store in this file, then we will include it in our program by writing Python codes and see what we can do.</p><p>The first thing to know about writing JSON data is that the data is always written between curly braces ({}). The curly braces represent the boundaries that contain our data, and no data is written outside the braces.</p><p>We write data between the curly braces with key and value pairs. The key represents the variables (in other words, the columns) in the data, and the value represents the observations (in other words, the row value corresponding to the relevant column) in the data. The key and value expressions are written between double quotes (\"\") and are separated from each other by a colon (:).</p><p>Key expressions can only be strings, but an exceptional case is that if no string expression is given, the key expression will be considered undefined by default. The value expression can be a string, number, array, boolean, object, null, or another JSON data written between curly braces. Also, if there is a key expression that follows, we need to separate the value and the key with a comma. Within the framework of what we have learned, we can write a simple JSON data as follows:</p><pre><code>{\n    \"name\": \"Baruch\",\n    \"surname\": \"Spinoza\",\n    \"age\": 45,\n    \"\": \"Undefined\",\n    \"isAlive\": false\n}</code></pre><p>The use of indentation is recommended as it increases data readability. So, if we had a list of books written by Spinoza, how would we write this data? We write array-type data, which is not of string or integer type, inside square brackets ([]), separating each value with a comma. An example is shown below.</p><pre><code>{\n    \"name\": \"Baruch\",\n    \"surname\": \"Spinoza\",\n    \"age\": 45,\n    \"books\": [\n        \"Ethics\",\n        \"Tractatus Politicus\",\n        \"Treatise on the Emendation of the Intellect\"\n                 ]\n}</code></pre><p>Let's also imagine that there is a date variable containing important dates like birth and death, but we don't want to store it as an array for clarity. We can write this data as a value expression in JSON format. An example usage is given below.</p><pre><code>{\n    \"name\": \"Baruch\",\n    \"surname\": \"Spinoza\",\n    \"age\": 45,\n    \"books\": [\n        \"Ethics\",\n        \"Tractatus Politicus\",\n        \"Treatise on the Emendation of the Intellect\"\n                 ],\n    \"dates\": {\n        \"birth\": \"24.11.1632\",\n        \"death\": \"21.02.1677\"\n             }\n}</code></pre><p>With what we have learned so far, it is possible to say that the Python dictionary data type and JSON data are quite similar in terms of writing and structure. From this, one might think that a rule valid for one is also valid for the other, but this is a mistaken approach. Now let's discuss the differences between the dictionary data type and JSON data.</p><p>We mentioned that JSON key expressions can only be of the string data type. This is not the case in Python dictionaries. In the dictionary data type, the key expression can be of different data types such as string or integer. In JSON data, this is one of the situations that will cause an error.</p><p>JSON key expressions are repeatable. That is, more than one key expression can be the same. Although this is not a recommended usage, the file will run without error. The Python dictionary type, however, does not allow this. In dictionaries, each key expression is unique, and if it is not, it returns an error. An example of JSON structure is given below.</p><pre><code>{\n    \"name\": \"Baruch\",\n    \"name\": \"Benedictus de\",\n    \"surname\": \"Spinoza\",\n    \"age\": 45\n}</code></pre><p>Sometimes we may need to use the data in the file within the program. We will explain later how to read a JSON data within the program. What we need to know for now is that when we read a JSON data with Python, the data will first be assigned to a variable of dictionary type. That is, when the file is read, the data written in JSON format is converted to the Python dictionary data type, and we can use the data in this way within the program or make various changes as desired. This might lead to the question: while the key expression must be unique in the dictionary data type, multiple identical key expressions can be used in JSON. Does this not cause an error, or how does the program read this? The answer is no, this situation does not cause any error in the program. Because when the program reads this data, it acts as if it has updated the relevant key value in the dictionary. That is, the key expression is not repeated and takes the last value given to it. Therefore, we would expect the Python output of the above example to be as follows:</p><p>{\"name”: “Benedictus de”, “surname”: “Spinoza”, “age”: “45”}</p><p>Finally, JSON data only supports the use of double quotes for string data. In contrast, in Python, we can express string data with single quotes, double quotes, or triple double quotes.</p><p>Up to this point, we have covered topics such as what JSON is, how to write JSON data, and the difference between Python dictionaries and JSON data. However, we don't just store data; we may need to use it in our program or rewrite it with new data. We will do this thanks to the “json” module that we will include in our program. First, let's “import” the “json” module into our program.</p><pre><code>import json</code></pre><p>In this module, we will talk about 4 functions we will use:</p><p><strong>Load:</strong> Reads data from a JSON file and assigns it to a variable of Python dictionary type. It takes the file path as a parameter. If the JSON file is in the same directory as our application, we can also use just the file name as a parameter.</p><pre><code>with open(\"PhilosopherSpinoza.json\") as file:\n    data = json.load(file)</code></pre><p><strong>Loads:</strong> Reads data from a string-type variable written in JSON form and assigns it to a variable of Python dictionary type. It takes the string-type data variable as a parameter.</p><pre><code>json_data = \"\"\"{ \n    \"name\": \"Baruch\",\n    \"surname\": \"Spinoza\",\n    ...\n                }\"\"\"\ndata = json.loads(json_data)</code></pre><p><strong>Dump:</strong> Converts dictionary-type data into a JSON file. It takes the dictionary-type data and the file path as parameters. If the file we are writing to is not an empty file, care must be taken to perform correct file operations to avoid losing data in the file and to preserve the existing structure of the file.</p><pre><code>data = {\n    \"name\": \"Baruch\",\n    ...\n        }\n\nwith open(\"PhilosopherSpinoza.json\", \"w\") as file:\n    json.dump(data, file)</code></pre><p><strong>Dumps:</strong> Converts dictionary-type data into a string-type variable written in JSON format. It takes the dictionary-type data variable as a parameter.</p><p>In the Dump and Dumps functions, we may want to write the data in a readable and orderly manner. For this, we use the indent parameter, which represents indentation and takes an integer value (usually 4, because 4 spaces equal 1 tab), and the sort_keys parameter, which performs alphabetical sorting and takes a boolean value (its default value is False; it takes the value True to perform sorting).</p><pre><code>data = {\n    \"name\": \"Baruch\",\n    ...\n        }\n\njson_data = json.dumps(data, indent=4, sort_keys=True)</code></pre><p>Thus, we have answered the questions of what JSON data is, what the difference is between JSON data and the dictionary data type, how to read and write a JSON data, and how to convert a dictionary-type data to JSON data, and we have learned how to work with JSON files.</p><h3>References:</h3><ol><li>https://www.geeksforgeeks.org/difference-between-json-and-dictionary-in-python/</li><li>https://www.geeksforgeeks.org/python-difference-between-json-dump-and-json-dumps/</li><li>https://www.geeksforgeeks.org/python-difference-between-json-load-and-json-loads/</li><li>https://kerteriz.net/python-json-okuma-yazma-donusturme-islemleri/</li><li>https://en.m.wikipedia.org/wiki/JSON</li><li>https://aws.amazon.com/what-is/json/</li></ol>"
  },
  "python-ile-e-mail-gondermek": {
    "title": "SENDING E-MAILS WITH PYTHON",
    "summary": "With the first electronic mail sent in 1971 by Raymond Samuel Tomlinson, an engineer at ARPANET, an institution affiliated with the United States, e-mail took its first step into the world of communication.",
    "content": "<p>With the first electronic mail sent in 1971 by Raymond Samuel Tomlinson, an engineer at ARPANET, an institution affiliated with the United States, e-mail took its first step into the world of communication. In 1976, Queen Elizabeth II of England, during her visit to the telecommunications research center in Malvern, became the first head of state to send an e-mail, using an account opened in her name with the nickname HME2 (Her Majesty Elizabeth 2).</p><p>The use of e-mail became widespread over time. So much so that 7 years after its invention, in 1978, Gary Thuerk, who worked for the computer manufacturer DEC and is now known as the father of spam, sent a mass e-mail to nearly 400 customers via ARPANET and achieved $13 million in DEC product sales with this mass e-mailing, becoming the progenitor of electronic marketing.</p><p>Since its invention, the scope of e-mail use has been expanding day by day and continues to do so. Today, it is frequently used in areas such as communication between employers and employees, students and teachers, for personal use, communication between sellers and customers, or for providing feedback, and for tracking a service received or a transaction performed. Since e-mail sending is a strategic and practical action, it can be done from various applications according to various needs, and it is also possible to do it with simple code blocks when things need to be accelerated and automated.</p><p>In this article, I will answer the questions of how to write an e-mail using the “email” library and how to send an e-mail using the “smtplib” library.</p><p>Before moving on to the coding part, let's create a passkey by entering the Gmail application, which offers a more secure alternative for protecting user information. At this stage, you can also choose to use your own password. It is possible to create a passkey on the following devices:</p><ul><li>A laptop or desktop computer with at least Windows 10, macOS Ventura, or ChromeOS 109 installed</li><li>A mobile device with at least iOS 16 or Android 9 installed</li><li>A hardware security key that supports the FIDO2 protocol</li></ul><p>Another important point for creating a passkey is that 2-step verification must be enabled. You can follow the directions below for this:</p><ol><li>Open https://myaccount.google.com/</li><li>In the navigation panel, select Security</li><li>From the “Signing in to Google” section, select 2-Step Verification > Get Started</li><li>Follow the steps shown on the screen.</li></ol><p>To create a passkey on your device:</p><ol><li>Go to https://myaccount.google.com/signinoptions/passkeys</li><li>Tap Create a passkey > Continue</li></ol><p>A JSON file is a way to securely store data for sharing our written codes with third-party applications or people. In this application, we will create “SenderInfo.json” and “ReceiverInfo.json” files containing personal and mail information, and we will access this information by reading these files within the application.</p><p>Let's write the sender's email account and passkey/password in the SenderInfo.json file.</p><pre><code>{\n    \"email\": \"samplemailaddress@gmail.com\",\n    \"password\": \"16digitsamplepasskey\"\n}</code></pre><p>In the ReceiverInfo.json file, let's write the email accounts of the recipient(s), subject, and message information. The subject and message information are kept in list form to easily add them in cases where we want to send different messages to each recipient. They can also be stored as strings depending on requests and needs.</p><pre><code>{\n    \"receivers\": [\"samplereceiver1@gmail.com\", \"samplereceiver2@gmail.com\"],\n    \"subject\": [\"sample subject\"],\n    \"message\": [\"sample message\"]\n}</code></pre><p>After creating the App.py file, let's write the following code block that reads the JSON files and assigns them to variables.</p><pre><code>import json\n\nwith open(\"SenderInfo.json\") as file:\n    senderInfo = json.load(file)\n\nwith open(\"ReceiverInfo.json\") as file:\n    receiverInfo = json.load(file)</code></pre><p>Then let's import the necessary modules for writing and sending e-mails.</p><pre><code>import smtplib\nfrom email.message import EmailMessage</code></pre><p>If the application gives an error at this stage, the relevant module(s) may not be available on your computer. Running the following commands in the terminal will solve the problem.</p><pre><code>pip install email\npip install smtplib</code></pre><p>Let's create the mailWriter function to compose the content of the e-mail to be sent. The mailWriter function takes sender, receiver, subject, and message parameters and returns an object of the EmailMessage class. The “mail” variable defined within the function is an object derived from the EmailMessage class of the email module. This object has some properties such as recipient, sender, message body, and subject. These properties take the parameters of the function. If Turkish characters are used in the mail content, `mail.set_default_type('text/plain; charset=utf-8')` should be added under the `mail.set_content(message)` line.</p><pre><code>def mailWriter(sender:str, receiver:str, subject: str, message: str) -> EmailMessage:\n    mail = EmailMessage()\n    mail[\"From\"] = sender\n    mail[\"To\"] = receiver\n    mail[\"Subject\"] = subject\n    mail.set_content(message)\n    return mail</code></pre><p>Let's create the sendWithSMTP function to send the created mail. This function takes sender, password, receiver, and message parameters and sends the mail via the smtplib module. There are 3 different ports and 2 different security layers to connect to the smtp.gmail.com host: 587, 465, and 25. Generally, port 587, called SMTP Submission, and the TLS security layer are commonly used between the client and the sending server. Port 25 is used as a standard between mail sending and receiving servers. Since service providers in Turkey decided to close port 25 for IP blocks used for ADSL in the fight against spam years ago, port 587 is used between the client and the server. If mail transmission between two servers is to be done with a secure layer, SSL or TLS port 465 is used. In the example, we will work with port 587.</p><pre><code>def sendWithSMTP(sender: str, password: str, receiver: str, message: EmailMessage):\n    with smtplib.SMTP(\"smtp.gmail.com\", 587) as smtp:\n        smtp.starttls()\n        smtp.login(user= sender, password= password)\n        smtp.send_message(from_addr= sender, to_addrs= receiver, msg= message)</code></pre><p>There are functions that prepare the mail content and send the e-mail with the SMTP Protocol. Finally, let's run these operations in a for loop to repeat them for multiple people. Let's define the “sender”, “password”, “receivers”, “subject”, and “message” variables and get the relevant information from the dict-type “senderInfo” and “receiverInfo” variables. The sending process will be completed by iterating through the receivers one by one with the for loop.</p><p>Although the enumerate structure is not used in this code block, it can be used with a small change like “subject= subject[e], message= message[e]” after making the necessary changes in the “ReceiverInfo.json” file when you want to send different messages to different people.</p><pre><code>sender = str(senderInfo.get(\"email\"))\npassword = str(senderInfo.get(\"password\"))\nreceivers = list(receiverInfo.get(\"receivers\"))\nsubject = list(receiverInfo.get(\"subject\"))\nmessage = list(receiverInfo.get(\"subject\"))\n\nfor e, i in enumerate(receivers):\n    mail = mailWriter(sender= sender,\n        receiver= i,\n        subject= subject[0],\n        message= message[0])\n    sendWithSMTP(sender= sender,\n        password= password,\n        receiver= i,\n        message= mail)</code></pre><p>You can run the file after checking if your internet connection is working. Thus, we have learned how to send mail with Python.</p><h3>References:</h3><ol><li>https://www.directiq.com/blog/the-social-and-technological-evolution-of-e-mail/</li><li>https://www.brandingturkiye.com/dunden-bugune-e-posta-e-mailin-tarihcesi</li><li>https://support.google.com/accounts/answer/185839?hl=en&co=GENIE.Platform%3DDesktop</li><li>https://support.google.com/accounts/answer/13548313?hl=en</li><li>https://www.hostinger.com/tutorials/what-is-smtp-server</li><li>https://docs.python.org/3/library/smtplib.html</li><li>https://docs.python.org/3/library/email.examples.html</li></ol>"
  },
  "veri-yapilari-ve-algoritmalar-giris": {
    "title": "DATA STRUCTURES AND ALGORITHMS: INTRODUCTION",
    "summary": "All kinds of operations that can be performed on a computer are carried out through computer programs.",
    "content": "<p>All kinds of operations that can be performed on a computer are carried out through computer programs. These programs consist of a command or a set of commands written by computer programmers. Computer programs are simply written using programming languages and are aimed at performing a task or purpose. At this stage, it is possible to say that programs do not consist of a single component. There are many issues to consider when writing computer programs or a program. Algorithms, design patterns, and data structures are examples of these. These and other issues are examined in depth throughout the project life cycle and are applied with a correct approach to the problem.</p><p>In this article, I will introduce the conceptual framework by making a simple introduction to the “data structures and algorithms” series, which is an important part of computer programs and also one of the fundamental courses of computer engineering. In the continuation of the series, I will explain the advanced topics of the data structures and algorithms course using the Java programming language.</p><p>Data within a program is stored in memory areas called “variables,” which are used to store data. Variables have basic properties such as name, type, value, and scope. Name refers to the definition of the variable by the programmer with certain rules; value refers to the data the variable stores; scope refers to the variable's area of influence, i.e., whether it is local or global; and type refers to what kind of data the variable stores. Although there are different formats for variables, there are basic data types. Examples of these include text, character, integer, floating-point number, boolean true/false, and array.</p><p>A data structure is various data representations that define methods for organizing, storing, and processing data. It is commonly used by people to mean the organization or structuring for a collection of data items. 10 integers stored in an array, the operations of adding and removing these integers from the array, and the relationship between the elements in the array can be shown as examples of a data structure. Commonly used data structures that I will cover in future articles are: Stacks, queues, trees, linked lists, graphs…</p><p>Data structures enable effective and efficient data management in programming. Choosing the right data structure during the application development process directly affects the performance and resource efficiency of the application. It can be seen that weak program designers ignore this analysis step and apply a data structure they are more familiar with but which is not suitable for the problem. As a result, a more costly, difficult to use and maintain, and slow program will likely be produced. In this case, the solution is inefficient, and efficiency has not been considered in the solution path.</p><p>Efficiency is the ability of the applied solution to solve the problem within the necessary resource constraints. Examples of resource constraints include the budget allocated for the relevant area, the available space for storing data, and the time allowed to perform each sub-task. Sometimes problems may not be solvable within the existing resource constraints. In these cases, it is observed that the cost increases because the amount of resources consumed by the solution is the factor that determines the cost of the solution. Also, in these problems, efficiency can be defined as the solution requiring fewer resources than its known alternatives, regardless of whether it meets certain requirements.</p><p>There are various analysis methods used in choosing the right data structure. These methods include evaluating the properties of the data, the requirements of the application, use cases, and performance criteria.</p><p>Some commonly used analysis methods are:</p><ul><li>Time Complexity Analysis: A method for evaluating the efficiency of an algorithm or computer program. Asymptotic analysis (Big O Notation) and Worst-case, Average-case, Best-case are the basic concepts of this analysis.</li><li>Space Complexity Analysis: Analyzes memory usage and how much memory the data structure consumes. Memory efficiency is especially important in large data sets.</li><li>Access and Manipulation Speed: Examining the speed of accessing and updating data.</li><li>Data Distribution Analysis: Determines whether some data structures are more suitable depending on how the data is distributed. For example, tree structures may be better for sorted data.</li><li>Scenario Analysis: Determines which data structure will perform better by evaluating various scenarios that may be encountered in real-world applications.</li><li>Application Requirements: Understanding the requirements of the application is a critical factor in choosing a data structure. For example, a linked list may be more suitable for an application that requires frequent insertion and deletion operations.</li><li>Ease of Use and Maintenance: Factors such as how easily the data structure can be used, learned, and how troublesome its maintenance is should also be considered.</li></ul><p>The choice of a data structure can be briefly summarized as follows:</p><ol><li>Analyzing the problem to determine the basic operations that need to be supported (insertion, deletion, search, etc.).</li><li>Measuring resource constraints and performing the necessary analyses.</li><li>Choosing the best data structure that meets the requirements.</li></ol><p>Abstract data types (ADT) are concepts that define what a particular data structure will look like and what operations can be performed on it, independent of implementation details. How the operations will be performed is not the subject of abstract data types but of data structures. Abstract data types stand as a layer above data structures. That is, an abstract data type is a concept, while a data structure is a concrete implementation of this concept.</p><p>Design patterns are used to make the software development process more efficient, flexible, and sustainable, and to help organize the structure, behavior, and interaction of software systems.</p><p>Design patterns are generally divided into 3 main categories:</p><ul><li>Creational patterns: Control the object creation process. These are; singleton pattern, factory method pattern, builder pattern, abstract factory pattern, and prototype pattern.</li><li>Structural patterns: Organize the relationships between classes and objects. These are; adapter pattern, composite pattern, decorator pattern, facade pattern, flyweight pattern, proxy pattern, bridge pattern.</li><li>Behavioral patterns: Define the interactions and communications of objects with each other. These are; observer pattern, strategy pattern, command pattern, iterator pattern, mediator pattern, chain of responsibility pattern, state pattern, template method pattern, visitor pattern, interpreter pattern, memento pattern.</li></ul><p>Design patterns are important in software development because of their features:</p><ul><li>Their repeatable nature saves developers time by covering previously solved problems.</li><li>They facilitate the understanding of complex systems by creating a common language among developers.</li><li>They make it easier for systems to adapt to changing requirements.</li><li>They facilitate maintenance processes by making the code more organized and understandable.</li></ul><p>A computer program or applications are developed on specific problems. A problem is an issue that needs to be solved to meet user needs or specific functions. The definition of a problem should not contain a constraint on how the problem is to be solved but may contain constraints on the resources for an acceptable solution method.</p><p>The path or process to follow to solve a problem is defined as an algorithm. Algorithms take a specific input, process this input, and produce an output. It is possible to solve a problem with more than one algorithm, and a particular algorithm solves only one problem. Algorithms have some basic properties:</p><ul><li>They take 0 or more inputs and produce an output by converting each input to the correct output or calculate the desired function.</li><li>They consist of a series of concrete steps, and each step is precisely defined.</li><li>They must be finite.</li></ul><p>A program is an instance or concrete representation of an algorithm. They aim to provide a solution to a problem or increase functionality. In short, a problem is a situation that needs to be solved; an algorithm is the definition of the steps to be followed to solve a problem; a program is the version of the algorithm written in a specific programming language and converted into a form that can be executed by a computer.</p><p>We mentioned that every operation on the computer is executed by a program and that algorithms must be finite. Although the operating system is a computer program, it does not meet the technical definition of an algorithm. Operating systems are such a program.</p>"
  },
  "python-ile-qr-kod-olusturmak": {
    "title": "CREATING QR CODES WITH PYTHON",
    "summary": "A QR code (Quick Response) or data matrix is a type of matrix barcode (two-dimensional barcode) that can be read by machines.",
    "content": "<p>A QR code (Quick Response) or data matrix is a type of matrix barcode (two-dimensional barcode) that can be read by machines. It was developed in 1994 and is patented by the Japanese company DENSO.</p><p>The data capacity of QR codes is quite limited:</p><ol><li>Maximum 7,090 characters for numeric data,</li><li>Maximum 4,291 characters for alphanumeric data,</li><li>Maximum 2,953 bytes for binary system (8 bit),</li><li>Maximum 1,817 characters for Kanji/Kana.</li></ol><p>Today, with the influence of mobile phones with digital cameras, the use of QR codes has become widespread. When a QR code is decoded, it can direct the user to an internet address, e-mail address, phone number, contact information, SMS or MMS, or geographic location information.</p><p>A free QR code converter can be obtained from many sources on the internet. In addition, when one wants to save time or cost or customize a QR code, more than these sources may be needed. In this article, I will explain how to convert data in various forms into a QR code with Python. For this, we will use the segno module.</p><p>With the segno module, a text and a link can be converted into a QR code, or micro QR codes that can hold less data can be created. In addition to these, operations such as establishing a wifi connection, creating a VCard or Mecard, sending an e-mail, showing your geographic location, or creating a QR code for EPC, one of the European payment systems, can also be performed thanks to this module. With this module, a file or image on a local device cannot be converted into a QR code because QR codes are structured to store very little data and cannot contain an image or a file. However, it is possible to convert the link of an image or file stored on a server into a QR code.</p><p>First, let's open the terminal and run the following command to install the Segno module on our computer.</p><pre><code>pip install segno</code></pre><p>Then let's import this module into the application. We will convert text and links into QR codes and create a micro QR code with the Segno module. With the helpers module within the Segno module, we will create QR codes for wifi, vcard, geographic location, and email.</p><pre><code>import segno\nfrom segno import helpers</code></pre><p>We can convert a text data or a link into a QR code with the “make_qr” function and save the created QR code to our local device with the “save” feature.</p><pre><code>text = \"Hello World!\"\nlink = \"www.linkedin.com/in/hanifekaptan-u1f90d\"\ntextqr = segno.make_qr(text)\nlinkqr = segno.make_qr(link)\ntextqr.save(\"textqr.png\", scale=15)\nlinkqr.save(\"linkqr.png\", scale=15)</code></pre><p>The thing to be careful about when creating a QR code is the size of the data. The size of the data can affect the readability of the QR code depending on the device used. Similarly, micro QR codes may sometimes not be readable with normal phone cameras. For this, micro QR codes can be useful when the necessary hardware is available.</p><pre><code>content = \"it's a micro qrcode\"\nmicroqr = segno.make_micro(content)</code></pre><p>The “make_wifi” function is used to create a QR code for a wifi connection. The make_wifi function takes ssid, password, and security as parameters. The security parameter can take 3 values: “WPA”, “WEP”, or None.</p><pre><code>ssid = \"ssid value\"\npassword = \"sample password\"\nsecurity = \"WPA\" #It can be WPA or WEP\nhelpers.make_wifi(ssid, password, security)</code></pre><p>Creating a QR code for VCard or MeCard can be a bit more troublesome than others. The “make_vcard” function is used for VCard, and the “make_mecard” function is used for MeCard. These functions, which basically work with the same logic as the others, take more parameters, but which parameters are used or not is entirely up to the user. One or more of the values below can be used in the relevant function.</p><pre><code>name= \"name\"\ndisplayname= \"displayname\"\n...\nhelpers.make_vcard(name= name,\n                   displayname= displayname,\n                   ...)\nhelpers.make_mecard(name= name,\n                   displayname= displayname,\n                   ...)</code></pre><p>When we create a QR code to send an e-mail, the “make_email” function is used, and basically, the parameters to (who it will be sent to), subject (the subject value), and body (the mail content) are used. In addition to these, cc or bcc values can also be used or not, depending on preference.</p><pre><code>to = \"sampleemail@gmail.com\"\nsubject = \"sample email qrcode\"\nbody = \"hello world\"\nhelpers.make_email(to, subject= subject, body= body)</code></pre><p>When converting geographic location information into a QR code, the “make_geo” function is used, and this function takes 2 numerical parameters. These are the latitude and longitude parameters. Entering non-existent values for latitude and longitude, which take values in a certain range, will cause an error.</p><pre><code>latitude = 39.55\nlongitude = 32.50\nhelpers.make_geo(lat= latitude, lng= longitude)</code></pre><p>Converting data into a QR code using Python is that easy with Segno.</p><h3>References:</h3><ol><li>https://en.m.wikipedia.org/wiki/QR_code</li><li>https://en.m.wikipedia.org/wiki/Data_Matrix</li><li>https://segno.readthedocs.io/en/latest/</li><li>https://pypi.org/project/segno/</li></ol>"
  },
  "veri-yapilari-stack": {
    "title": "DATA STRUCTURES AND ALGORITHMS: THE STACK DATA STRUCTURE",
    "summary": "A data structure is a various representation that defines methods for organizing, storing, and processing data.",
    "content": "<p>A data structure is a various representation that defines methods for organizing, storing, and processing data. Based on this, it can be said that appropriate data structures should be selected and used for effective data management.</p><p>One of the most fundamental data structures used in computer science is the stack data structure. The stack data structure can be thought of as a pile, just as its name suggests. The most important feature of this data structure is that it works on the LIFO (Last In, First Out) principle.</p><p>To make it easier to understand, let's imagine a pile of plates stacked on top of each other. We can take a plate from this pile as needed and put it back after we're done. But from where did we choose to take the plate from the pile, and where did we put the plate we returned? Taking the plate from the top of the pile and putting it back on top is, of course, a behavior that almost everyone would prefer. As seen in the example, the operations performed on the pile are carried out with the item at the very top of the pile. This is a representative example that explains the logic of the stack data structure, and this example explains how the stack data structure organizes data, how data is stored, and what operations can be performed on the data. According to the example, each plate represents a piece of data, and the entire stack of plates represents an array, and these are stored in the relevant memory areas of the computer.</p><h2>The basic operations in the stack data structure are as follows:</h2><ul><li>Push: Adds an element to the stack. The new element is added to the top of the stack. If the stack is full, the addition operation is not performed, and the program returns an error.</li><li>Pop: Removes an element from the stack. The element to be removed from the stack is the element at the top. If the stack is empty, the element removal operation cannot be performed, and the program returns an error.</li><li>Peek/Top: Returns the top element of the stack.</li><li>getCount: Returns the number of elements contained in the stack.</li><li>isEmpty: Returns whether the stack is empty or not.</li><li>isFull: Returns whether the stack is full or not.</li></ul><h2>Now that we understand the basic logic of the stack data structure, let's look at where it is used:</h2><ul><li>The function structures we use in programming languages benefit from the stack data structure. When a function is called, the local variables and return addresses of each call are stored on the stack, and when the function ends, they are removed from the stack.</li><li>The undo operation, which we see in many applications and simply perform with Ctrl+Z, is also done with the stack data structure. Each action the user performs is added to the stack, and with the undo operation, the last action performed, i.e., the last data added to the stack, is removed to perform the undo operation.</li><li>We encounter the use of stacks at many points in the source code processing of compilers. Checking the rules of the language during the syntactic analysis phase, showing which functions the program called when an error occurred, the compiler adding each token to the stack and processing it during tokenization, and the control of loop structures are just a few of these.</li><li>In games, stacks can be used to manage the states of characters or objects. A character's movement or inventory actions can be stored on the stack.</li><li>Sometimes the stack data structure can be used in conjunction with other data structures or algorithms.</li></ul><p>We can talk about the advantages of the stack data structure as follows;</p><ul><li>The stack data structure has O(1) time complexity and is an ideal option, especially for situations requiring high performance.</li><li>Being simple to understand and implement allows developers to develop applications more quickly.</li><li>It is efficient in terms of memory usage because the size generally only takes up as much space as is necessary. This feature also indicates that the stack data structure is lightweight and low-cost.</li></ul><p>However, it also has disadvantages;</p><ul><li>Since the size is not dynamic, adding elements is not possible when the stack is full (stack overflow). This can cause unwanted problems, especially in large data sets.</li><li>The stack only allows access to the top element. This makes direct access to a specific element difficult.</li><li>Operations on the stack can slow down when working with large data sets. Performance issues can arise, especially if there are a large number of function calls or deeply nested loop structures.</li></ul><p>We talked about the stack data structure, its features, advantages/disadvantages, and areas of use. Finally, let's implement the stack data structure using Java.</p><p>Note: All code written in this example is written using Java 22, the latest version of Java as of September 24, 2024, and through NetBeans.</p><p>If you are using NetBeans for the first time, a blank page will probably appear on the screen when it opens. To write our codes, we first need to open a java file. For this, first open the File option located at the top left corner of the screen, then select the New Project option. In the tab that opens, select Java With Ant and then Java Application below it, and click the Next button. Then, on the next page that opens, fill in the application name as “MyStack” and specify its location. Then, when we press the Finish button, a java file named “MyStack.java” will be created under the DataStructure folder.</p><pre><code>package DataStructures;\n\npublic class MyStack { \n    public static void main(String[] args) {\n        System.out.println( \"Data Structures: Stack\" ); \n    } \n}</code></pre><p>When the file is created, some codes will open in a ready-made template form. The expression “package DataStructure” on the first line indicates the folder where the file is located. With the MyStack class, we will create our own Stack structure and add basic operations into it. The point to be careful about here is that the name of the file and the name of the class must be the same. If they are not the same, the application will give an error. If you have created your file with the name “stack”, the application may give an error during use. This may be due to the fact that Java has its own stack class, and complexities may arise when you create a file with the name stack again. The “public static void main(String[] args)” function, which comes ready between the class parentheses, is the part where we will write the codes we want to run in the application. By writing “System.out.println( “Data Structures: Stack” );” between the blocks, we are printing our own title to the screen.</p><p>...</p>"
  },
  "elektronik-devreler-kirchhoff-kanunlari": {
    "title": "ELECTRONIC CIRCUITS: KIRCHHOFF'S LAWS AND THE MESH ANALYSIS METHOD",
    "summary": "In electronic circuits, current and voltage are the fundamental physical quantities that determine the circuit's operation.",
    "content": "<p>In electronic circuits, current and voltage are the fundamental physical quantities that determine the circuit's operation. Current defines the movement of electric charges, while voltage determines the cause and direction of this movement.</p><p>Both affect the transmission and use of electrical energy. Furthermore, it can be said that the concepts of current and voltage, which form the basic building blocks of electrical circuits, are of critical importance in circuit analysis, design, and operation. Let's briefly look at these concepts.</p><p>Current refers to the flow rate of electric charges (usually electrons) passing from one point to another. It is denoted by the symbol I and measured in Amperes (A). Since current is generally thought of as the movement of positive charges, the direction of current is defined as the direction of positive charges. However, in reality, current is usually carried by negative charges (electrons). Current creates voltage drops across circuit elements (resistors, capacitors, etc.) and is the carrier of electrical energy. It provides the energy required for devices to operate.</p><p>Voltage is the electric potential difference between two points. It is denoted by the symbol U or V and measured in Volts (V). Voltage is the driving force required for charges to move from one point to another. It is defined to create a current from a point of high potential to a point of low potential. The role of voltage in a circuit is to create the current in the circuit (as current does not flow without voltage) and to determine the capacity to do work on circuit elements. An example of this is how the voltage across a resistor affects the current passing through that resistor.</p><h2>Ohm's Law</h2><p>The relationship between current and voltage can be explained by Ohm's law. Ohm's law states that the voltage across a conductor is proportional to the current passing through the conductor. That is, the current in a circuit depends on the voltage and resistance value in that circuit. Mathematically, it is shown as follows:</p><p>U = I x R</p><p>In this formula, U represents voltage, I represents electric current, and R represents resistance. Let's exemplify Ohm's law using the visual. On the left of the image, we see a series-connected electrical circuit, and on the right, a parallel-connected one. In these circuits, there is a voltage source and 2 light bulbs with an internal resistance of 1 ohm, but the current passing through the circuit is unknown. Using Ohm's law, let's find out how much current is passing through the circuits:</p><p>First, let's start with the example on the left. We know that there is a voltage of 6 volts in the circuit. In electrical circuits, the value of series-connected resistors is calculated by summing their values. In this circuit, we will use this method to calculate the internal resistances of the series-connected bulbs. 2 series-connected bulbs with an internal resistance of 1 ohm have a total internal resistance of 2 ohms. So, we can use the formula to calculate the current. “6 V = I x 2 ohm” In this way, the current value I is calculated as 3 amperes. That is, the current passing through the circuit is 3 amperes.</p><p>Second, let's look at the example on the right. In the circuit, there is a 6-volt voltage source and 2 bulbs with internal resistances of 1 ohm connected in parallel. For parallel-connected resistors, the equivalent resistance Req needs to be calculated. For two parallel resistors, the equivalent resistance Req is calculated as follows: “1/Req = 1/R1 + 1/R2”. In this formula, we need to write the values of 1 ohm, which represents the internal resistance of the bulbs, in place of R1 and R2. 1/1 + 1/1 gives the value 2. If 1/Req = 2, then we can say Req = 1/2 or 0.5 ohm. So, we have a voltage of 6 volts and our resistors have an equivalent resistance of 0.5 ohm. If we apply the formula, it would be “6 V = I x 0.5 ohm”. The current value I is thus obtained as 12 amperes.</p><h2>KIRCHHOFF'S LAWS:</h2><p>Another physical law that aims to explain the relationships between current and voltage is Kirchhoff's laws. Kirchhoff's laws explain two fundamental principles that define current and voltage relationships in electronic circuits. These are Kirchhoff's Current Law (KCL) and Kirchhoff's Voltage Law (KVL). These laws, used together with resistors, capacitors, inductors, and other components, also help in solving complex circuits.</p><h3>Kirchhoff’s Current Law (KCL)</h3><p>Kirchhoff’s current law states that the total current at a node is zero. That is, the sum of the currents entering a node is equal to the sum of the currents leaving that node. This law is based on the principle of conservation of electric charge. This can be expressed mathematically as follows:</p><p>∑ I_entering = ∑ I_leaving</p><p>As seen in the visual, currents I1 and I4 enter a node, while currents I2, I5, and I3 leave this node. Kirchhoff's current law says about these currents that the sum of the entering current values is equal to the sum of the leaving current values. We can show this as follows:</p><p>I1 + I4 = I2 + I5 + I3</p><h3>Kirchhoff’s Voltage Law (KVL)</h3><p>Kirchhoff’s voltage law states that the total voltage in a closed circuit is zero. That is, the sum of all voltages (both positive and negative) in a circuit loop is zero. This law is based on the principle of conservation of energy. This can be expressed mathematically as follows:</p><p>∑ U = 0</p><p>If we want to apply Kirchhoff's voltage law to the circuit in the visual, we would write it as follows:</p><p>-E1 + V1 + V2 = 0</p><p>Or, if we call the current passing through the circuit I, we can express the voltages V1 and V2 across resistors R1 and R2 as follows:</p><p>-E1 + (I x R1) + (I x R2) = 0</p><p>When discussing the mesh analysis method, we will revisit Kirchhoff's voltage law and explain why the E1 value is written as negative and the V1 and V2 values as positive, which will be mentioned in the clockwise arrow drawing in the visual.</p><h2>MESH ANALYSIS METHOD</h2><p>The mesh analysis method can be used as an application of Kirchhoff's laws in electrical circuit analysis. This method offers a systematic approach to determining the currents and voltages in a circuit, for both simple and complex circuits. Furthermore, the mesh analysis method is suitable for both AC and DC circuit analysis. Let's look at how the mesh analysis method is applied step by step:</p><h3>Identifying the Circuit:</h3><p>Identify the circuit and its elements (resistors, capacitors, inductors, sources, etc.). To be able to apply the mesh method, it is important to understand the circuit clearly. Looking at the circuit in the visual, we see that there is a 9 V voltage source and 2 resistors of unknown magnitude. It is also given that a current of 1.8 A passes through the circuit and the voltage drop across the resistors is also provided. So, let's calculate the unknown resistance values using the mesh equation.</p><h3>Identifying the Meshes:</h3><p>Identify the meshes in the circuit. A mesh can be chosen in any direction (clockwise or counter-clockwise). There are rules to be careful about when identifying a mesh. The mesh must pass over at least one element, and according to the chosen mesh or meshes, there should be no element in the circuit that the mesh does not pass over. The mesh is used as a reference to determine the direction of the current. In the example, we see that the mesh direction is drawn clockwise. Accordingly, where the current enters is marked as plus (+) and where it leaves is marked as minus (-). If the counter-clockwise direction were chosen, we would determine the plus and minus markings on the resistors according to the mesh direction because the mesh direction indicates the direction of the current in the circuit. We know that the direction of the mesh does not change the result, but it changes the sign of the result. Thus, it can be understood where the plus and minus signs marked on the resistors in the visual come from. Unless otherwise specified, the plus and minus applications in circuit analysis are determined according to the mesh direction.</p><h3>Applying Kirchhoff’s Voltage Law (KVL):</h3><p>Kirchhoff’s voltage law is applied over the mesh. KVL states that the total voltage in a mesh is zero. At this stage, equations are created by considering voltage drops and sources. Let's write the mesh equation by looking at the example:</p><p>-V1 + V2 + V3 = 0</p><p>According to the mesh direction, since the current enters from the negative terminal of the voltage source V1, the voltage V1 is written with a negative sign. However, when we look at the other voltages, the mesh direction enters from the positive terminal. To see if the equation is correct, let's substitute the values given in the problem into the equation:</p><p>-9V + 3.6V + 5.4V = 0</p><p>We can see with a simple calculation that the equation is correct.</p><h3>Applying Kirchhoff’s Current Law (KCL):</h3><p>Kirchhoff’s current law is applied for the currents in the mesh. The currents entering and leaving each resistor are written in the equation. In more complex circuits, we will need to draw more than one mesh direction. However, in our example, one mesh is drawn, and the sum of the currents passing through the resistors is equal to the current passing through the mesh. Let's rewrite this equation using Ohm's law and KCL. Let's assume that the resistor with voltage V2 is given as 2R and the resistor with voltage V3 is given as 3R in the problem. Then:</p><p>-9V + (1.8A x 2R) + (1.8A x 3R) = 0</p><h3>Solving the Equation:</h3><p>The created equations are solved systematically to find the current, voltage, or resistance values. Let's solve the equation:</p><p>-9V + 3.6R + 5.4R = -9V + 9R = 0</p><p>9R = 9V and R = 1 ohm. According to the operations, the resistors are 2 ohm and 3 ohm, respectively.</p><p>The topic covered in this article explains the basics of Kirchhoff's laws and the mesh analysis method. In more complex and multi-node circuit systems, the mesh analysis method will be explained under the heading of “mesh analysis.”</p>"
  },
  "elektronik-devreler-thevenin-teoremi": {
    "title": "ELECTRONIC CIRCUITS: THEVENIN'S THEOREM",
    "summary": "Thevenin's Theorem is an extremely useful method used for the analysis of electrical circuits.",
    "content": "<p>Thevenin's Theorem is an extremely useful method used for the analysis of electrical circuits. This theorem allows any linear electrical circuit to be converted into a simple equivalent circuit consisting of a voltage source (Vth) and a resistor (Rth). Thevenin's Theorem is particularly used for simplifying complex circuits and analyzing the effects on a specific load. The Thevenin equivalent circuit required to represent a circuit is defined as follows:</p><p><strong>Thevenin Equivalent Voltage (Vth):</strong> The Thevenin equivalent voltage is the voltage between any two terminals of a circuit. This voltage is calculated by taking into account the other sources and resistors in the circuit. In an electrical circuit, a load is an element that performs a specific job, consumes, or stores energy, such as a resistor, inductor, or capacitor, and if the equivalent voltage is to be calculated, the calculation is done by removing the loads from the circuit.</p><p><strong>Thevenin Equivalent Resistance (Rth):</strong> The equivalent resistance is the resistance value between the two specified terminals when all independent circuit sources are turned off (voltage sources are short-circuited, current sources are open-circuited).</p><h2>The following steps are followed to apply Thevenin's theorem:</h2><h3>Identify the Circuit:</h3><p>The circuit to which Thevenin's theorem will be applied is identified. Usually, the part where Thevenin's theorem is to be applied is shown as an open circuit between terminals A and B. However, this is a representation of the part of the circuit to be analyzed, and it is known that the circuit is not normally an open circuit.</p><h3>Calculate the Equivalent Voltage (Vth):</h3><p>We can use Kirchhoff's voltage law to calculate the Vth value. The total voltage in the circuit must be equal to 0. So, we calculate the voltage between terminals A and B by removing the resistor (or other loads).</p><h3>Calculate the Equivalent Resistance (Rth):</h3><p>All independent sources are removed from the circuit:</p><ul><li>Voltage sources are short-circuited.</li><li>Current sources are open-circuited.</li></ul><p>When this process is performed, a circuit containing resistors connected in series or parallel is obtained. The Rth value is obtained by calculating the resistance between the two terminals.</p><h3>Draw the New Circuit:</h3><p>The Thevenin equivalent model of the circuit is drawn with the calculated Rth and Vth values, and if necessary, the circuit is completed.</p><h2>Example:</h2><p>In the circuit above, let's find the Thevenin equivalent between terminals A and B and calculate the current passing through the 5 Ω and 1 Ω resistors.</p><p>We see that there are two voltage sources of 10 V and 16 V and resistors of 4 Ω, 2 Ω, 5 Ω, and 1 Ω in the circuit. Since the problem asks for the Thevenin equivalent between terminals A and B, we will perform calculations on the part of the circuit that includes the voltage sources and the 4 Ω and 2 Ω resistors.</p><p>Now that we have identified the circuit, let's calculate the Vth value. When we remove the resistors between terminals A and B, we calculate the voltage value as follows:</p><p>-10 V + 16 V = 6 V</p><p>Let's say we are summing the voltage values in the direction of the arrow since the voltage sources are connected in opposite directions. We can also directly sum voltage sources in the same direction. Thus, the Vth value is calculated as 6 V.</p><p>As the next step, we calculate the Rth value. The independent voltage sources between terminals A and B are short-circuited, and independent current sources are open-circuited. Since this example does not contain a current source, let's short-circuit the voltage sources. Between terminals A and B of the circuit, there remain 2 Ω and 4 Ω resistors connected in series. The Rth value in this problem is the sum of the series-connected resistors. Thus, the Rth value is calculated as 6 Ω.</p><p>Finally, let's draw the Thevenin equivalent model of the circuit with the calculated Rth = 6 Ω and Vth = 6 V values and complete the circuit. The problem asked us to find the Thevenin equivalent and calculate the current passing through the 5 Ω and 1 Ω resistors. Let's calculate the current passing through the 5 Ω and 1 Ω resistors using the Thevenin equivalent model and Ohm's law.</p><p>6 V = I x (Rth + 5 Ω + 1 Ω) = I x (6 Ω + 5 Ω + 1 Ω) = I x 12 Ω</p><p>I = 6 V / 12 Ω = 0.5 A is calculated.</p><p>It is also possible to solve for the current passing through the 5 Ω and 1 Ω resistors in the circuit using the mesh analysis method, which I explained in my previous article. For more information on the mesh analysis method, you can refer to the article I wrote earlier.</p>"
  },
  "veritabani-yonetim-sistemleri-giris": {
    "title": "DATABASE MANAGEMENT SYSTEMS: INTRODUCTION",
    "summary": "Various data storage methods have been used in different periods of history.",
    "content": "<p>Various data storage methods have been used in different periods of history. In ancient times, these were pictures drawn on cave walls, hieroglyphs written on clay tablets, and in later periods with changing life conditions, writings on animal skins, and with the invention of paper and printing, books and files. Although these were great discoveries that affected daily life at that time, the real turning point for data storage began with the development of electronic computing devices. In the first computer systems, methods of recording on magnetic disks, drum memories, and magnetic tapes were predominant. With the spread of microcomputers, floppy disks and then optical disks (CD, DVD), SSDs with the increase in the data storage capacity of hard disks, USB memories, database management systems, and cloud storage services have met the need for data storage. The question of how to manage the increasing data has been effective in the development of these systems over time. Database systems are one of the systems developed in line with the same needs.</p><p>A database is a system where data is stored, managed, and accessed in an organized and interrelated manner. They can be relational (SQL) or non-relational (NoSQL) systems. Databases are used to facilitate data management in various applications.</p><p>A database management system (DBMS) is a program used to create, store, replicate, update, manage, and access databases. MySQL, PostgreSQL, Oracle, MongoDB, Microsoft Access, IBM DB2, Informix, Progress, and Microsoft SQL Server are commonly used database management systems.</p><p>Database management systems offer several advantages.</p><ul><li>It protects data integrity by ensuring the consistency, accuracy, and security of the data.</li><li>It ensures data security by offering features such as user authorization, encryption, backup, and recovery, protecting the data from unauthorized access.</li><li>It enables the structuring (data standardization) and storage of data in a consistent and standard way.</li><li>It provides data integration by integrating data from different sources on a single system.</li><li>It allows multiple users to access and update data simultaneously and supports real-time transactions or decision-making.</li><li>It offers fast access, querying, and reporting capabilities for data.</li><li>It provides logical data modeling independent of the physical data storage structure, thus ensuring data independence.</li><li>It prevents data loss with regular backup and fast recovery features.</li><li>It offers a scalable structure according to increasing data and user needs.</li><li>It facilitates the monitoring, reporting, and management of operations on the database.</li></ul><p>Let's examine various database management systems and their features:</p><ul><li><strong>Access:</strong> An MS Office product. It is for small-scale applications. It can store up to 2 GB of data per table. It can allow up to 255 connections simultaneously. It cannot be used on operating systems other than Windows.</li><li><strong>MySQL:</strong> It is open-source. It runs on all types of operating systems. It can store up to 4 TB of data per table.</li><li><strong>SQL Server (MSSQL):</strong> A Microsoft product. It only runs on Windows. It is high-cost. It is used for medium and large-scale operations. It can store up to 4 TB of data per table. It has advanced features.</li><li><strong>Informix:</strong> Developed by Illustra and acquired by IBM in 2001. It is a paid and powerful database. It has the capacity to handle the load of medium-sized businesses.</li><li><strong>IBM DB2:</strong> An IBM product. It runs on all types of operating systems. It has advanced features.</li><li><strong>PostgreSQL:</strong> It runs on all types of operating systems. It is free and open-source. It has 64 TB of data storage per table. It has a very powerful transaction structure and advanced features.</li><li><strong>Oracle:</strong> Developed by Oracle Corporation. It is the world's most powerful and reliable database. It runs on all types of operating systems. It is preferred for very large-scale applications. The number of tables that can be created is unlimited. Its cost is high.</li></ul><p><strong>Table,</strong> is the basic structure where data is stored in the database. A table consists of rows (records) and columns (fields). Each column contains a specific data type. A database can contain multiple tables.</p><p><strong>Record (row),</strong> is each row within a table. Each row contains information about an entity. For example, a customer record may include the customer's name, address, and phone number.</p><p><strong>Field (column),</strong> is each column within a table. Each column can contain data of different data types. For example, names use character types, number information uses numerical data types, and birth dates use date data types. When creating a database, the table, columns, and data types belonging to the table are defined first.</p><p><strong>Key,</strong> is used to uniquely identify records in the database. There are two types of keys in databases: primary key and foreign key.</p><ul><li><strong>Primary key,</strong> ensures that each row is uniquely identified. A table can contain only one primary key. The primary key should represent a unique value for each record, such as a person's national ID number, phone number, school number, e-mail address, fingerprint, or bank card number.</li><li><strong>Foreign key,</strong> establishes a relationship between two tables by referencing a primary key in another table within the same database.</li></ul><p><strong>Relationship,</strong> is the connection between two or more tables in the database. Relationships are generally classified into four types:</p><ul><li>One-to-one (1–1): Represents a one-to-one relationship. Each record in one table matches one record in the other table.</li><li>One-to-many (1 — N): Represents a one-to-many relationship. One record in one table matches multiple records in the other table.</li><li>Many-to-one (N — 1): Represents a many-to-one relationship. Multiple records in one table match one record in the other table.</li><li>Many-to-many (N— M): Represents a many-to-many relationship. Records in both tables can have multiple matches with each other.</li></ul><p><strong>Query,</strong> are commands that allow various operations to be performed on the database. These queries can be performed for many purposes such as retrieving data, creating tables, creating databases, adding data, deleting data, and modifying existing data. SQL (Structured Query Language) is the most common query language used in relational databases.</p><p><strong>Data model,</strong> is a framework that defines the structure and relationships of the data in the database. There are different types such as relational, hierarchical, network, and object-oriented data models.</p<p><strong>Data integrity,</strong> means the accuracy and consistency of the data in the database. Data integrity is ensured by various rules and constraints.</p><p><strong>Backup and recovery,</strong> are the processes of regularly backing up the database to prevent data loss and recovering data in case of a problem.</p><p><strong>Data normalization,</strong> is a process used in database design to reduce data redundancy and ensure data integrity. Normalization ensures that data is structured in a logical way.</p>"
  },
  "github-conventional-commits": {
    "title": "GITHUB COMMIT STANDARDIZATION: CONVENTIONAL COMMITS",
    "summary": "The other day, before uploading an autonomous AI agent project I was working on to GitHub, a question came to my mind.",
    "content": "<p>The other day, before uploading an autonomous AI agent project I was working on to GitHub, a question came to my mind. Thanks to Git, which gives developers of all levels the freedom to make mistakes freely, we can manage any change we make in the project and save them with commit messages. But don't you feel that we often spoil the whole magic of such a powerful system with commit messages that are often unclear or carelessly written? How can we create a culture of writing clean and standard commit messages that everyone can understand, which truly makes the project history valuable?</p><p>Since it's not taught in schools, I think students and young friends especially will understand me. Because I, too, was someone who didn't know what to write in commit messages—no matter how insignificant a detail it may seem—and eventually got lost in a complex version history. After a short research, I was introduced to a widely used standard that puts an end to this confusion: Conventional Commits.</p><p>Thanks to this standardization, I left my chaotic commit history behind and started writing commits that are highly readable, easy to follow, and managed with a simple logic. Moreover, this small change also took my knowledge of topics like automatic changelog generation and semantic versioning one step further.</p><p>In this article, we will discuss in detail the “Conventional Commits” standard that will improve the quality of your project.</p><p>If you are someone like me who cares about every little detail and commits frequently, you know how meaningless GitHub's automatic “Updated /filename” message can be. Every commit doesn't mean adding a new feature to the project or fixing a critical bug. Sometimes we fix a simple typo, sometimes we just do formatting that improves the readability of the code, and sometimes we update the documentation.</p><p>Here, Conventional Commits classifies the changes we make in a meaningful way based on these differences. With tags like `fix`, `feat`, `docs`, `chore`, `refactor`, it allows us to clearly express the purpose and scope of each new update at first glance.</p><p>The standard template of this system is as follows:</p><pre><code>&lt;type&gt;(&lt;optional scope&gt;): &lt;subject&gt;\n\n&lt;optional body&gt;\n\n&lt;optional footer&gt;</code></pre><p>This structure consists of a type that specifies the purpose of the change, a subject that summarizes what it is about, optionally a scope that indicates which part of the project the change affects, and a body text for more detailed explanations. Now let's examine these concepts more closely.</p><h2>Type</h2><p>The most commonly used types are:</p><h3>feat (Feature)</h3><p>Used when you add new functionality to your project.</p><p>Example:</p><p>feat: allow users to send voice commands</p><h3>fix (Bug Fix)</h3><p>Used when you fix a bug in your code.</p><p>Example:</p><p>fix: correct the invalid response structure sent to the server</p><h3>docs (Documentation)</h3><p>Used only for changes in documentation files (like README.md) or in comment lines/docstrings in the code.</p><p>Example:</p><p>docs: add docstring for ‘validate_user’ function</p><h3>style (Styling)</h3><p>Used for changes related only to formatting and style (spaces, semicolons, linter rules, etc.) that do not affect the meaning or operation of the code.</p><p>Example:</p><p>style: rename function name according to PEP8 standards</p><h3>refactor (Code Refactoring)</h3><p>Changes that do not fix a bug or add a new feature, but only improve the structure, readability, or architecture of the existing code.</p><p>Example:</p><p>refactor: modularize preprocessing logic into separate functions</p><h3>test (Tests)</h3><p>Used when you add new tests or update existing ones. Does not include a change in the source code.</p><p>Example:</p><p>test: add unit tests for user registration flow</p><h3>perf (Performance)</h3><p>Used for code changes that improve performance.</p><p>Example:</p><p>perf(db): optimize insert queries with batch processing</p><h3>build (Build System)</h3><p>Used for changes that affect the project's build system, CI/CD processes, or external dependencies (e.g., package.json, requirements.txt).</p><p>Example:</p><p>build: update ‘requests’ dependency to version 2.31.0</p><h3>chore (Chores)</h3><p>Routine maintenance tasks that do not affect the source code, tests, or documentation, usually related to project management or auxiliary tools.</p><p>Example:</p><p>chore: add __pycache__ folder to .gitignore</p><h3>revert (Revert)</h3><p>Indicates a change that reverts a previous commit. It is usually automatically generated by the ‘git revert’ command.</p><p>Example:</p><p>revert: feat(auth): add password reset functionality</p><h2>Subject</h2><p>After determining the type, a short subject line summarizing the change is written. It is recommended that this section be a maximum of 50 characters and written in the imperative mood.</p><h2>Scope (Optional)</h2><p>Indicates which part of the project the change affects. This makes it very easy to understand where the change was made when looking at the commit history.</p><p>Example:</p><p>fix(api): add missing ‘user_id’ parameter to response</p><h2>Body (Optional)</h2><p>If the subject line is insufficient to explain the change, you can fill in the body section by leaving a blank line. Here you can detail “why” the change was made and “how” it provides a solution. It is great for providing context that may not be immediately obvious from the code.</p><h2>Footer (Optional)</h2><p>This section is for metadata.</p><ul><li><strong>Related Issues:</strong> Indicates which task the change is related to (Jira, Trello, GitHub Issues, etc.). You can automatically close the related task with keywords like Closes #45, Fixes JIRA-123.</li><li><strong>BREAKING CHANGE:</strong> If the change you made breaks backward compatibility (for example, if you changed the structure of an API endpoint), you must explain this in the footer with a BREAKING CHANGE: prefix.</li><li><strong>Collaborators:</strong> You can specify the people you co-authored the code with (Co-authored-by:) or who reviewed it (Reviewed-by:).</li></ul><p>Below you can find a detailed example of a commit message that conforms to the Conventional Commits standards, using all the elements.</p><pre><code>feat(auth): implement Google OAuth2 login\n\nAllows users to sign in with their Google accounts, not just with\nemail/password. This improves user experience and is expected to\nincrease registration rates.\n\nIntegration was completed using the 'passport-google-oauth20' strategy.\n\nCloses: #78\n\nBREAKING CHANGE: The '/auth/login' endpoint now expects a mandatory 'strategy'\nfield, which can be 'local' or 'google'.</code></pre><h3>References</h3><p><a href='https://www.conventionalcommits.org/en/v1.0.0/' target='_blank' rel='noopener noreferrer'>https://www.conventionalcommits.org/en/v1.0.0/</a></p>"
  }
}